nufeb/thirdparty/sedifoam/cases/example-cases/jetFlow/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          turbulenceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;
// simulationType  laminar;
LES
{
    LESModel    kEqn;
    turbulence  on;
    printCoeffs on;
    delta       cubeRootVol;

    cubeRootVolCoeffs
    {
    }
}


// ************************************************************************* //
