nufeb/thirdparty/sedifoam/cases/example-cases/jetFlow/Allrun.sh
blockMesh > log.blockMesh
decomposePar > log.decomposePar

mpirun -np 6 lammpsFoam -parallel > log.parallel
